app/controllers/articles_controller.rb

  def create
    @article = Article.new(articles_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Resident Evil 7"], ["body", "A zombie game"], ["created_at", "2021-05-12 18:40:11.316087"], ["updated_at", "2021-05-12 18:40:11.316087"], ["status", "public"]]